In [3]:
import pandas as pd
from io import StringIO

In [4]:
json_data = '{"Name":"Iron Man","Alias":"Tony Stark","Characteristics":[{"first":"Billionaire","second":"Intelligent","third":"Play Boy"}]}'

df = pd.read_json(StringIO(json_data))

In [5]:
df

       Name       Alias                                    Characteristics
0  Iron Man  Tony Stark  {'first': 'Billionaire', 'second': 'Intelligen...

In [6]:
df.to_json()

'{"Name":{"0":"Iron Man"},"Alias":{"0":"Tony Stark"},"Characteristics":{"0":{"first":"Billionaire","second":"Intelligent","third":"Play Boy"}}}'

In [7]:
df.to_json(orient="index")

'{"0":{"Name":"Iron Man","Alias":"Tony Stark","Characteristics":{"first":"Billionaire","second":"Intelligent","third":"Play Boy"}}}'

In [8]:
df.to_json(orient="records")

'[{"Name":"Iron Man","Alias":"Tony Stark","Characteristics":{"first":"Billionaire","second":"Intelligent","third":"Play Boy"}}]'

In [9]:
df1 = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data",header=None)

In [22]:
df1.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
count,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000
mean,1.938202,13.000618,2.336348,2.366517,19.494944,99.741573,2.295112,2.029270,0.361854,1.590899,5.058090,0.957449,2.611685,746.893258
std,0.775035,0.811827,1.117146,0.274344,3.339564,14.282484,0.625851,0.998859,0.124453,0.572359,2.318286,0.228572,0.709990,314.907474
min,1.000000,11.030000,0.740000,1.360000,10.600000,70.000000,0.980000,0.340000,0.130000,0.410000,1.280000,0.480000,1.270000,278.000000
25%,1.000000,12.362500,1.602500,2.210000,17.200000,88.000000,1.742500,1.205000,0.270000,1.250000,3.220000,0.782500,1.937500,500.500000
50%,2.000000,13.050000,1.865000,2.360000,19.500000,98.000000,2.355000,2.135000,0.340000,1.555000,4.690000,0.965000,2.780000,673.500000
75%,3.000000,13.677500,3.082500,2.557500,21.500000,107.000000,2.800000,2.875000,0.437500,1.950000,6.200000,1.120000,3.170000,985.000000
max,3.000000,14.830000,5.800000,3.230000,30.000000,162.000000,3.880000,5.080000,0.660000,3.580000,13.000000,1.710000,4.000000,1680.000000

In [12]:
df1.to_csv("wine.csv")

In [20]:
url="https://www.fdic.gov/bank-failures/failed-bank-list"

df2 = pd.read_html(url)

In [25]:
df2[0]

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund
0,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540

In [26]:
df

       Name       Alias                                    Characteristics
0  Iron Man  Tony Stark  {'first': 'Billionaire', 'second': 'Intelligen...

In [27]:
df.to_pickle("iron_man_pickle")

In [28]:
pd.read_pickle("iron_man_pickle")

       Name       Alias                                    Characteristics
0  Iron Man  Tony Stark  {'first': 'Billionaire', 'second': 'Intelligen...